/**
 * 
 */
package com.keung.spring4hibernate3.modules.test;

/**
 *                   _ooOoo_
 *                  o8888888o
 *                  88" . "88
 *                  (| -_- |)
 *                  O\  =  /O
 *               ____/`---'\____
 *             .'  \\|     |//  `.
 *            /  \\|||  :  |||//  \
 *           /  _||||| -:- |||||-  \
 *           |   | \\\  -  /// |   |
 *           | \_|  ''\---/''  |   |
 *           \  .-\__  `-`  ___/-. /
 *         ___`. .'  /--.--\  `. . __
 *      ."" '<  `.___\_<|>_/___.'  >'"".
 *     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *     \  \ `-.   \_ __\ /__ _/   .-` /  /
 * ======`-.____`-.___\_____/___.-`____.-'======
 *                   `=---='
 * ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *         佛祖保佑       永无BUG
 *  佛曰:
 *       写字楼里写字间，写字间里程序员；  
 *       程序人员写程序，又拿程序换酒钱。  
 *       酒醒只在网上坐，酒醉还来网下眠；  
 *       酒醉酒醒日复日，网上网下年复年。  
 *       但愿老死电脑间，不愿鞠躬老板前；  
 *       奔驰宝马贵者趣，公交自行程序员。  
 *       别人笑我忒疯癫，我笑自己命太贱；  
 *       不见满街漂亮妹，哪个归得程序员？
 *
 * @Title: BubbleSort.java 
 * @description TODO
 * @author mac keung_java@126.com
 * @date 2016年4月5日 下午10:18:49 
 */
public class BubbleSort
{

	public static void main(String[] args)
	{
		int arr[] = new int[] { 90, 101, 88, 100, 7, 10, 1, 3, 5, 2 };
		/*
		 * i = 0, j = 1 --> 7.10.1.3.5
		 * i = 0, j = 2 --> 1.10.7.3.5
		 * i = 0, j = 3 --> 1.10.7.3.5
		 * i = 0, j = 4 --> 1.10.7.3.5
		 * i = 1, j = 2 --> 1.7.10.3.5
		 * i = 1, j = 3 --> 1.3.10.7.5 
		 * i = 1, j = 4 --> 1.3.10.7.5
		 * i = 2, j = 1 --> 1.3.7.10.5
		 * i = 2, j = 2 --> 1.3 
		 */
		int i, j;
		// 最外层控制比较次数
		for (i = arr.length - 1; i > 0; i--)
		{
			for (j = 0; j <= i - 1; j++)
			{
				if (arr[j] > arr[j + 1])
				{
					int tmp = arr[j + 1];
					arr[j + 1] = arr[j];
					arr[j] = tmp;
				}
			}
		}

		System.out.println("========可以排序，但不是最优的冒泡排序=============================");
		for (int m : arr)
		{
			System.out.print(m + " ");
		}
	}
}
